import { Cast } from "../cast"

const cast: Cast = {
    4: { 村人: 2, 占い: 1, 人狼: 1 },
    5: { 村人: 3, 占い: 1, 人狼: 1 },
    6: { 村人: 4, 占い: 1, 人狼: 1 },
    7: { 村人: 5, 占い: 1, 人狼: 1 },
    8: { 村人: 5, 占い: 1, 人狼: 2 },
    9: { 村人: 5, 占い: 1, 霊能: 1, 人狼: 2 },
    10: { 村人: 5, 占い: 1, 霊能: 1, 狂人: 1, 人狼: 2 },
    11: { 村人: 5, 占い: 1, 霊能: 1, 狩人: 1, 狂人: 1, 人狼: 2 },
    12: { 村人: 6, 占い: 1, 霊能: 1, 狩人: 1, 狂人: 1, 人狼: 2 },
    13: { 村人: 4, 占い: 1, 霊能: 1, 共有: 2, 狩人: 1, 狂人: 1, 人狼: 2, 妖狐: 1 },
    14: { 村人: 5, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 狂人: 1, 人狼: 2, 妖狐: 1 },
    15: { 村人: 6, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 狂人: 1, 人狼: 2, 妖狐: 1 },
    16: { 村人: 6, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 狂人: 1, 人狼: 3, 妖狐: 1 },
    17: { 村人: 7, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 狂人: 1, 人狼: 3, 妖狐: 1 },
    18: { 村人: 6, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 猫又: 1, 狂人: 1, 人狼: 4, 妖狐: 1 },
    19: { 村人: 7, 占い: 1, 霊能: 1, 狩人: 1, 共有: 2, 猫又: 1, 狂人: 1, 人狼: 4, 妖狐: 1 },
}

export default cast